app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New article"], ["description", "testing flash"], ["created_at", "2020-03-22 02:39:42.336031"], ["updated_at", "2020-03-22 02:39:42.336031"]]