app/controllers/users_controller.rb

UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "rohit2"], ["email", "rohit2@example.com"], ["updated_at", "2020-03-23 20:10:23.919893"], ["id", 2]]
---
    def update
        if @user.update(user_params)

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 3]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 5]]
---
    def show
        @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)