app/views/categories/index.html.erb

SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 2]]
---
                    </li>
                    <li><%= pluralize(category.articles.count, "article") %></small></li>