app/views/layouts/_navigation.html.erb

          <%= link_to "All Categories", categories_path, class: "dropdown-item" %>
          <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"